In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)
data

array([[ 0.46087517, -0.28087802,  1.47235399],
       [-1.34361777, -0.5277408 ,  0.7241264 ],
       [ 0.59315707, -1.63004448, -0.35657905],
       [-0.29989457,  0.33272047,  1.16120138]])

In [3]:
data

array([[ 0.46087517, -0.28087802,  1.47235399],
       [-1.34361777, -0.5277408 ,  0.7241264 ],
       [ 0.59315707, -1.63004448, -0.35657905],
       [-0.29989457,  0.33272047,  1.16120138]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0  0.460875 -0.280878  1.472354
1 -1.343618 -0.527741  0.724126
2  0.593157 -1.630044 -0.356579
3 -0.299895  0.332720  1.161201

In [6]:
newDataFrame = pd.DataFrame(data, index = ["Zeynep","Büşra","Ali","Mehmet"], columns=["Maas","Yas","Calisma Saati"])

In [7]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep  0.460875 -0.280878       1.472354
Büşra  -1.343618 -0.527741       0.724126
Ali     0.593157 -1.630044      -0.356579
Mehmet -0.299895  0.332720       1.161201

In [8]:
newDataFrame["Yas"]

Zeynep   -0.280878
Büşra    -0.527741
Ali      -1.630044
Mehmet    0.332720
Name: Yas, dtype: float64

In [9]:
newDataFrame["Calisma Saati"]

Zeynep    1.472354
Büşra     0.724126
Ali      -0.356579
Mehmet    1.161201
Name: Calisma Saati, dtype: float64

In [10]:
newDataFrame[["Maas","Yas"]]

            Maas       Yas
Zeynep  0.460875 -0.280878
Büşra  -1.343618 -0.527741
Ali     0.593157 -1.630044
Mehmet -0.299895  0.332720

In [11]:
newDataFrame.loc["Mehmet"]

Maas            -0.299895
Yas              0.332720
Calisma Saati    1.161201
Name: Mehmet, dtype: float64

In [12]:
newDataFrame.loc["Büşra"]

Maas            -1.343618
Yas             -0.527741
Calisma Saati    0.724126
Name: Büşra, dtype: float64

In [13]:
newDataFrame.iloc[1]

Maas            -1.343618
Yas             -0.527741
Calisma Saati    0.724126
Name: Büşra, dtype: float64

In [14]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep  0.460875 -0.280878       1.472354
Büşra  -1.343618 -0.527741       0.724126
Ali     0.593157 -1.630044      -0.356579
Mehmet -0.299895  0.332720       1.161201

In [15]:
newDataFrame["Maas"]

Zeynep    0.460875
Büşra    -1.343618
Ali       0.593157
Mehmet   -0.299895
Name: Maas, dtype: float64

In [16]:
newDataFrame["Emeklilik Yasi"] = newDataFrame["Yas"]+ newDataFrame["Yas"]

In [17]:
newDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Zeynep  0.460875 -0.280878       1.472354       -0.561756
Büşra  -1.343618 -0.527741       0.724126       -1.055482
Ali     0.593157 -1.630044      -0.356579       -3.260089
Mehmet -0.299895  0.332720       1.161201        0.665441

In [18]:
newDataFrame.drop("Emeklilik Yasi", axis = 1)

            Maas       Yas  Calisma Saati
Zeynep  0.460875 -0.280878       1.472354
Büşra  -1.343618 -0.527741       0.724126
Ali     0.593157 -1.630044      -0.356579
Mehmet -0.299895  0.332720       1.161201

In [19]:
newDataFrame.drop("Mehmet" , axis = 0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Zeynep  0.460875 -0.280878       1.472354       -0.561756
Büşra  -1.343618 -0.527741       0.724126       -1.055482
Ali     0.593157 -1.630044      -0.356579       -3.260089

In [20]:
newDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Zeynep  0.460875 -0.280878       1.472354       -0.561756
Büşra  -1.343618 -0.527741       0.724126       -1.055482
Ali     0.593157 -1.630044      -0.356579       -3.260089
Mehmet -0.299895  0.332720       1.161201        0.665441

In [21]:
newDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True)

In [22]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep  0.460875 -0.280878       1.472354
Büşra  -1.343618 -0.527741       0.724126
Ali     0.593157 -1.630044      -0.356579
Mehmet -0.299895  0.332720       1.161201

In [23]:
newDataFrame.loc["Zeynep"]["Calisma Saati"]

1.4723539862824886

In [24]:
newDataFrame.loc["Zeynep","Yas"]

-0.2808780172006819

In [25]:
newDataFrame < 0

         Maas    Yas  Calisma Saati
Zeynep  False   True          False
Büşra    True   True          False
Ali     False   True           True
Mehmet   True  False          False

In [26]:
booleanFrame = newDataFrame < 0

In [27]:
booleanFrame

         Maas    Yas  Calisma Saati
Zeynep  False   True          False
Büşra    True   True          False
Ali     False   True           True
Mehmet   True  False          False

In [28]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep  0.460875 -0.280878       1.472354
Büşra  -1.343618 -0.527741       0.724126
Ali     0.593157 -1.630044      -0.356579
Mehmet -0.299895  0.332720       1.161201

In [29]:
newDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Zeynep       NaN -0.280878            NaN
Büşra  -1.343618 -0.527741            NaN
Ali          NaN -1.630044      -0.356579
Mehmet -0.299895       NaN            NaN

In [30]:
newDataFrame[newDataFrame < 0]

            Maas       Yas  Calisma Saati
Zeynep       NaN -0.280878            NaN
Büşra  -1.343618 -0.527741            NaN
Ali          NaN -1.630044      -0.356579
Mehmet -0.299895       NaN            NaN

In [31]:
newDataFrame[newDataFrame["Yas"] > 0]

            Maas      Yas  Calisma Saati
Mehmet -0.299895  0.33272       1.161201

In [32]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep  0.460875 -0.280878       1.472354
Büşra  -1.343618 -0.527741       0.724126
Ali     0.593157 -1.630044      -0.356579
Mehmet -0.299895  0.332720       1.161201

In [33]:
newDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0  Zeynep  0.460875 -0.280878       1.472354
1   Büşra -1.343618 -0.527741       0.724126
2     Ali  0.593157 -1.630044      -0.356579
3  Mehmet -0.299895  0.332720       1.161201

In [34]:
newDataFrame

            Maas       Yas  Calisma Saati
Zeynep  0.460875 -0.280878       1.472354
Büşra  -1.343618 -0.527741       0.724126
Ali     0.593157 -1.630044      -0.356579
Mehmet -0.299895  0.332720       1.161201

In [35]:
indexList = ["Zey","Büş","Ali","Meh"]

In [36]:
newDataFrame["Yeni Index"] = indexList

In [37]:
newDataFrame

            Maas       Yas  Calisma Saati Yeni Index
Zeynep  0.460875 -0.280878       1.472354        Zey
Büşra  -1.343618 -0.527741       0.724126        Büş
Ali     0.593157 -1.630044      -0.356579        Ali
Mehmet -0.299895  0.332720       1.161201        Meh

In [38]:
newDataFrame.set_index("Yeni Index")

                Maas       Yas  Calisma Saati
Yeni Index
Zey         0.460875 -0.280878       1.472354
Büş        -1.343618 -0.527741       0.724126
Ali         0.593157 -1.630044      -0.356579
Meh        -0.299895  0.332720       1.161201

In [39]:
newDataFrame

            Maas       Yas  Calisma Saati Yeni Index
Zeynep  0.460875 -0.280878       1.472354        Zey
Büşra  -1.343618 -0.527741       0.724126        Büş
Ali     0.593157 -1.630044      -0.356579        Ali
Mehmet -0.299895  0.332720       1.161201        Meh

In [40]:
newDataFrame.set_index("Yeni Index", inplace=True)

In [41]:
newDataFrame

                Maas       Yas  Calisma Saati
Yeni Index
Zey         0.460875 -0.280878       1.472354
Büş        -1.343618 -0.527741       0.724126
Ali         0.593157 -1.630044      -0.356579
Meh        -0.299895  0.332720       1.161201

In [42]:
newDataFrame.loc["Büş"]

Maas            -1.343618
Yas             -0.527741
Calisma Saati    0.724126
Name: Büş, dtype: float64

In [54]:
firstIndex=["Simpson","Simpson", "Simpson","South Park","South Park","South Park","South Park"]

In [60]:
innerIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [61]:
unifyIndex = list(zip(firstIndex,innerIndex))

In [62]:
unifyIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [63]:
unifyIndex = pd.MultiIndex.from_tuples(unifyIndex)

In [64]:
unifyIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [49]:
type(unifyIndex)

pandas.core.indexes.multi.MultiIndex

In [65]:
animatedCartoonList=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [67]:
animatedCartoonNumpyList = np.array(animatedCartoonList)

In [69]:
cartoonDataFrame = pd.DataFrame(animatedCartoonNumpyList, index=unifyIndex,columns=["Yas","Meslek"])

In [70]:
cartoonDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [71]:
cartoonDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [72]:
cartoonDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [73]:
cartoonDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [74]:
cartoonDataFrame.index.names = ["Film Name","Name"]

In [75]:
cartoonDataFrame

                   Yas Meslek
Film Name  Name
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F